ch32-riscv-ug/CH32V20x/EVT_205/EXAM/USBHS/Device/CompatibilityHID/User/ch32v205_usbhs_device.c
                            case HID_GET_REPORT: /* 0x01: GET_REPORT */
                                if(USBHS_SetupReqIndex == 0x00)
                                {
                                    Hid_Report_Ptr = 0;
                                    len = (USBHS_SetupReqLen >= DEF_USBD_UEP0_SIZE) ? DEF_USBD_UEP0_SIZE : USBHS_SetupReqLen;
                                    memcpy(USBHS_EP0_Buf, &HID_Report_Buffer[Hid_Report_Ptr], len);
                                    Hid_Report_Ptr += len;
                                }
                                else
                                {
                                    errflag = 0xFF;
                                }
                                break;

                            case HID_SET_IDLE: /* 0x0A: SET_IDLE */
                                if(USBHS_SetupReqIndex == 0x00)
                                {
                                    USBHS_HidIdle = (uint8_t)(USBHS_SetupReqValue >> 8);
                                }
                                else
                                {
                                    errflag = 0xFF;
                                }
                                break;

                            case HID_SET_PROTOCOL: /* 0x0B: SET_PROTOCOL */
                                if(USBHS_SetupReqIndex == 0x00)
                                {
                                    USBHS_HidProtocol = (uint8_t)USBHS_SetupReqValue;
                                }
                                else
                                {
                                    errflag = 0xFF;
                                }
                                break;

                            case HID_GET_IDLE: /* 0x02: GET_IDLE */
                                if(USBHS_SetupReqIndex == 0x00)
                                {
                                    USBHS_EP0_Buf[0] = USBHS_HidIdle;
                                    len = 1;
                                }
                                else
                                {
                                    errflag = 0xFF;
                                }
                                break;

                            case HID_GET_PROTOCOL: /* 0x03: GET_PROTOCOL */
                                if(USBHS_SetupReqIndex == 0x00)
                                {
                                    USBHS_EP0_Buf[0] = USBHS_HidProtocol;
                                    len = 1;
                                }
                                else
                                {
                                    errflag = 0xFF;
                                }
                                break;
                            default:
                                errflag = 0xFF;
                                break;
                            }
                        }
                        else if(USBHS_SetupReqType & USB_REQ_TYP_VENDOR)
                        {
                            /* Manufacturer request */
                        }
                        else
                        {
                            errflag = 0xFF;
                        }
                    }
                    else
                    {
                        /* usb standard request processing */
                        switch(USBHS_SetupReqCode)
                        {
                        /* get device/configuration/string/report/... descriptors */
                        case USB_GET_DESCRIPTOR:
                            switch((uint8_t)(USBHS_SetupReqValue >> 8))
                            {
                            /* get usb device descriptor */
                            case USB_DESCR_TYP_DEVICE:
                                pUSBHS_Descr = MyDevDescr;
                                len = DEF_USBD_DEVICE_DESC_LEN;
                                break;

                            /* get usb configuration descriptor */
                            case USB_DESCR_TYP_CONFIG:
                                /* Query current usb speed */
                                if(USBHSD->MIS_ST & USBHS_UDMS_HS_MOD)
                                {
                                    /* High speed mode */
                                    USBHS_DevSpeed = USBHS_SPEED_HIGH;
                                    USBHS_DevMaxPackLen = DEF_USBD_HS_PACK_SIZE;
                                    Head_Pack_Len = 2;
                                    Data_Pack_Max_Len = DEF_USBD_HS_PACK_SIZE - Head_Pack_Len;
                                }
                                else
                                {
                                    /* Full speed mode */
                                    USBHS_DevSpeed = USBHS_SPEED_FULL;
                                    USBHS_DevMaxPackLen = DEF_USBD_FS_PACK_SIZE;
                                    Head_Pack_Len = 1;
                                    Data_Pack_Max_Len = DEF_USBD_FS_PACK_SIZE - Head_Pack_Len;
                                }

                                /* Load usb configuration descriptor by speed */
                                if(USBHS_DevSpeed == USBHS_SPEED_HIGH)
                                {
                                    /* High speed mode */
                                    pUSBHS_Descr = MyCfgDescr_HS;
                                    len = DEF_USBD_CONFIG_HS_DESC_LEN;
                                }
                                else
                                {
                                    /* Full speed mode */
                                    pUSBHS_Descr = MyCfgDescr_FS;
                                    len = DEF_USBD_CONFIG_FS_DESC_LEN;
                                }
                                break;

                            /* get usb string descriptor */
                            case USB_DESCR_TYP_STRING:
                                switch((uint8_t)(USBHS_SetupReqValue & 0xFF))
                                {
                                /* Descriptor 0, Language descriptor */
                                case DEF_STRING_DESC_LANG:
                                    pUSBHS_Descr = MyLangDescr;
                                    len = DEF_USBD_LANG_DESC_LEN;
                                    break;

                                /* Descriptor 1, Manufacturers String descriptor */
                                case DEF_STRING_DESC_MANU:
                                    pUSBHS_Descr = MyManuInfo;
                                    len = DEF_USBD_MANU_DESC_LEN;
                                    break;

                                /* Descriptor 2, Product String descriptor */
                                case DEF_STRING_DESC_PROD:
                                    pUSBHS_Descr = MyProdInfo;
                                    len = DEF_USBD_PROD_DESC_LEN;
                                    break;

