ch32-riscv-ug/CH32V20x/EVT_205/EXAM/USBHS/Device/CompatibilityHID/User/ch32v205_usbhs_device.c
                                /* Descriptor 3, Serial-number String descriptor */
                                case DEF_STRING_DESC_SERN:
                                    pUSBHS_Descr = MySerNumInfo;
                                    len = DEF_USBD_SN_DESC_LEN;
                                    break;

                                default:
                                    errflag = 0xFF;
                                    break;
                                }
                                break;

                            /* get usb device qualify descriptor */
                            case USB_DESCR_TYP_QUALIF:
                                pUSBHS_Descr = MyQuaDesc;
                                len = DEF_USBD_QUALFY_DESC_LEN;
                                break;

                            /* get usb BOS descriptor */
                            case USB_DESCR_TYP_BOS:
                                /* USB 2.00 DO NOT support BOS descriptor */
                                errflag = 0xFF;
                                break;

                            /* get usb other-speed descriptor */
                            case USB_DESCR_TYP_SPEED:
                                if(USBHS_DevSpeed == USBHS_SPEED_HIGH)
                                {
                                    /* High speed mode */
                                    memcpy(&TAB_USB_HS_OSC_DESC[2], &MyCfgDescr_FS[2], DEF_USBD_CONFIG_FS_DESC_LEN - 2);
                                    pUSBHS_Descr = (uint8_t *)&TAB_USB_HS_OSC_DESC[0];
                                    len = DEF_USBD_CONFIG_FS_DESC_LEN;
                                }
                                else if(USBHS_DevSpeed == USBHS_SPEED_FULL)
                                {
                                    /* Full speed mode */
                                    memcpy(&TAB_USB_FS_OSC_DESC[2], &MyCfgDescr_HS[2], DEF_USBD_CONFIG_HS_DESC_LEN - 2);
                                    pUSBHS_Descr = (uint8_t *)&TAB_USB_FS_OSC_DESC[0];
                                    len = DEF_USBD_CONFIG_HS_DESC_LEN;
                                }
                                else
                                {
                                    errflag = 0xFF;
                                }
                                break;

                            case USB_DESCR_TYP_REPORT:
                                if(USBHS_DevSpeed == USBHS_SPEED_HIGH)
                                {
                                    pUSBHS_Descr = MyHIDReportDesc_HS;
                                    len = DEF_USBD_REPORT_DESC_LEN;
                                }
                                else
                                {
                                    pUSBHS_Descr = MyHIDReportDesc_FS;
                                    len = DEF_USBD_REPORT_DESC_LEN;
                                }

                                break;
                            case USB_DESCR_TYP_HID:
                                if(USBHS_SetupReqIndex == 0x00)
                                {
                                    if(USBHS_DevSpeed == USBHS_SPEED_HIGH)
                                    {
                                        pUSBHS_Descr = &MyCfgDescr_HS[18];
                                        len = 9;
                                    }
                                    else
                                    {
                                        pUSBHS_Descr = &MyCfgDescr_FS[18];
                                        len = 9;
                                    }
                                }
                                else
                                {
                                    errflag = 0xFF;
                                }
                                break;

                            default:
                                errflag = 0xFF;
                                break;
                            }

                            /* Copy Descriptors to Endp0 DMA buffer */
                            if(USBHS_SetupReqLen > len)
                            {
                                USBHS_SetupReqLen = len;
                            }
                            len = (USBHS_SetupReqLen >= DEF_USBD_UEP0_SIZE) ? DEF_USBD_UEP0_SIZE : USBHS_SetupReqLen;
                            memcpy(USBHS_EP0_Buf, pUSBHS_Descr, len);
                            pUSBHS_Descr += len;
                            break;

                        /* Set usb address */
                        case USB_SET_ADDRESS:
                            USBHS_DevAddr = (uint16_t)(USBHS_SetupReqValue & 0xFF);
                            break;

                        /* Get usb configuration now set */
                        case USB_GET_CONFIGURATION:
                            USBHS_EP0_Buf[0] = USBHS_DevConfig;
                            if(USBHS_SetupReqLen > 1)
                            {
                                USBHS_SetupReqLen = 1;
                            }
                            break;

                        /* Set usb configuration to use */
                        case USB_SET_CONFIGURATION:
                            USBHS_DevConfig = (uint8_t)(USBHS_SetupReqValue & 0xFF);
                            USBHS_DevEnumStatus = 0x01;
                            break;

                        /* Clear or disable one usb feature */
                        case USB_CLEAR_FEATURE:
                            if((USBHS_SetupReqType & USB_REQ_RECIP_MASK) == USB_REQ_RECIP_DEVICE)
                            {
                                /* clear one device feature */
                                if((uint8_t)(USBHS_SetupReqValue & 0xFF) == 0x01)
                                {
                                    /* clear usb sleep status, device not prepare to sleep */
                                    USBHS_DevSleepStatus &= ~0x01;
                                }
                                else
                                {
                                    errflag = 0xFF;
                                }
                            }
                            else if((USBHS_SetupReqType & USB_REQ_RECIP_MASK) == USB_REQ_RECIP_ENDP)
                            {
                                /* Set End-point Feature */
                                if((uint8_t)(USBHS_SetupReqValue & 0xFF) == USB_REQ_FEAT_ENDP_HALT)
                                {
                                    /* Clear End-point Feature */
                                    switch((uint8_t)(USBHS_SetupReqIndex & 0xFF))
                                    {
                                    case(DEF_UEP1 | DEF_UEP_OUT):
                                        /* Set End-point 2 OUT ACK */
                                        USBHSD->UEP1_RX_CTRL = USBHS_UEP_R_RES_ACK;
                                        break;

                                    case(DEF_UEP1 | DEF_UEP_IN):
                                        /* Set End-point 2 IN NAK */
                                        USBHSD->UEP1_TX_CTRL = USBHS_UEP_T_RES_NAK;
                                        break;

                                    case(DEF_UEP3 | DEF_UEP_OUT):
                                        /* Set End-point 3 OUT ACK */
                                        USBHSD->UEP3_RX_CTRL = USBHS_UEP_R_RES_ACK;
                                        break;

                                    case(DEF_UEP4 | DEF_UEP_IN):
                                        /* Set End-point 4 IN NAK */
                                        USBHSD->UEP4_TX_CTRL = USBHS_UEP_T_RES_NAK;
                                        break;

                                    case(DEF_UEP5 | DEF_UEP_OUT):
                                        /* Set End-point 5 OUT ACK */
                                        USBHSD->UEP5_RX_CTRL = USBHS_UEP_R_RES_ACK;
                                        break;

                                    case(DEF_UEP6 | DEF_UEP_IN):
                                        /* Set End-point 6 IN NAK */
                                        USBHSD->UEP6_TX_CTRL = USBHS_UEP_T_RES_NAK;
                                        break;

                                    default:
                                        errflag = 0xFF;
                                        break;
                                    }
                                }
                                else
                                {
                                    errflag = 0xFF;
                                }
                            }
                            else
                            {
                                errflag = 0xFF;
                            }
                            break;

                        /* set or enable one usb feature */
                        case USB_SET_FEATURE:
                            if((USBHS_SetupReqType & USB_REQ_RECIP_MASK) == USB_REQ_RECIP_DEVICE)
                            {
                                /* Set Device Feature */
                                if((uint8_t)(USBHS_SetupReqValue & 0xFF) == USB_REQ_FEAT_REMOTE_WAKEUP)
                                {
                                    if(((USBHS_DevSpeed == USBHS_SPEED_HIGH) && (MyCfgDescr_HS[7] & 0x20)) ||
                                       ((USBHS_DevSpeed == USBHS_SPEED_FULL) && (MyCfgDescr_FS[7] & 0x20)))
                                    {
                                        /* Set Wake-up flag, device prepare to sleep */
                                        USBHS_DevSleepStatus |= 0x01;
                                    }
                                    else
                                    {
                                        errflag = 0xFF;
                                    }
                                }
                                else if((uint8_t)(USBHS_SetupReqValue & 0xFF) == 0x02)
                                {
                                    /* test mode deal */
                                    if((USBHS_SetupReqIndex == 0x0100) ||
                                       (USBHS_SetupReqIndex == 0x0200) ||
                                       (USBHS_SetupReqIndex == 0x0300) ||
                                       (USBHS_SetupReqIndex == 0x0400))
                                    {
                                        /* Set the flag and wait for the status to be uploaded before proceeding with the actual operation */
                                        USBHS_Test_Flag |= 0x80;
                                    }
                                }
                                else
                                {
                                    errflag = 0xFF;
                                }
                            }
                            else if((USBHS_SetupReqType & USB_REQ_RECIP_MASK) == USB_REQ_RECIP_ENDP)
                            {
                                /* Set End-point Feature */
                                if((uint8_t)(USBHS_SetupReqValue & 0xFF) == USB_REQ_FEAT_ENDP_HALT)
                                {
                                    /* Set end-points status stall */
                                    switch((uint8_t)(USBHS_SetupReqIndex & 0xFF))
                                    {
                                    case(DEF_UEP1 | DEF_UEP_OUT):
                                        /* Set End-point 1 OUT STALL */
                                        USBHSD->UEP1_RX_CTRL = (USBHSD->UEP1_RX_CTRL & ~USBHS_UEP_R_RES_MASK) | USBHS_UEP_R_RES_STALL;
                                        break;

                                    case(DEF_UEP1 | DEF_UEP_IN):
                                        /* Set End-point 1 IN STALL */
                                        USBHSD->UEP1_TX_CTRL = (USBHSD->UEP1_TX_CTRL & ~USBHS_UEP_T_RES_MASK) | USBHS_UEP_T_RES_STALL;
                                        break;

                                    case(DEF_UEP3 | DEF_UEP_OUT):
                                        /* Set End-point 3 OUT STALL */
                                        USBHSD->UEP3_RX_CTRL = (USBHSD->UEP3_RX_CTRL & ~USBHS_UEP_R_RES_MASK) | USBHS_UEP_R_RES_STALL;
                                        break;

                                    case(DEF_UEP4 | DEF_UEP_IN):
                                        /* Set End-point 4 IN STALL */
                                        USBHSD->UEP4_TX_CTRL = (USBHSD->UEP4_TX_CTRL & ~USBHS_UEP_T_RES_MASK) | USBHS_UEP_T_RES_STALL;
                                        break;

                                    case(DEF_UEP5 | DEF_UEP_OUT):
                                        /* Set End-point 5 OUT STALL */
                                        USBHSD->UEP5_RX_CTRL = (USBHSD->UEP5_RX_CTRL & ~USBHS_UEP_R_RES_MASK) | USBHS_UEP_R_RES_STALL;
                                        break;

                                    case(DEF_UEP6 | DEF_UEP_IN):
                                        /* Set End-point 6 IN STALL */
                                        USBHSD->UEP6_TX_CTRL = (USBHSD->UEP6_TX_CTRL & ~USBHS_UEP_T_RES_MASK) | USBHS_UEP_T_RES_STALL;
                                        break;

                                    default:
                                        errflag = 0xFF;
                                        break;
                                    }
                                }
                            }
                            break;

                        /* This request allows the host to select another setting for the specified interface  */
                        case USB_GET_INTERFACE:
                            USBHS_EP0_Buf[0] = 0x00;
                            if(USBHS_SetupReqLen > 1)
                            {
                                USBHS_SetupReqLen = 1;
                            }
                            break;

                        case USB_SET_INTERFACE:
                            break;

                        /* host get status of specified device/interface/end-points */
                        case USB_GET_STATUS:
                            USBHS_EP0_Buf[0] = 0x00;
                            USBHS_EP0_Buf[1] = 0x00;
                            if((USBHS_SetupReqType & USB_REQ_RECIP_MASK) == USB_REQ_RECIP_ENDP)
                            {
                                switch((uint8_t)(USBHS_SetupReqIndex & 0xFF))
                                {
                                case(DEF_UEP1 | DEF_UEP_OUT):
                                    if(((USBHSD->UEP1_RX_CTRL) & USBHS_UEP_R_RES_MASK) == USBHS_UEP_R_RES_STALL)
                                    {
                                        USBHS_EP0_Buf[0] = 0x01;
                                    }

                                case(DEF_UEP1 | DEF_UEP_IN):
                                    if(((USBHSD->UEP1_TX_CTRL) & USBHS_UEP_T_RES_MASK) == USBHS_UEP_T_RES_STALL)
                                    {
                                        USBHS_EP0_Buf[0] = 0x01;
                                    }
                                    break;

                                case(DEF_UEP2 | DEF_UEP_IN):
                                    if(((USBHSD->UEP2_TX_CTRL) & USBHS_UEP_T_RES_MASK) == USBHS_UEP_T_RES_STALL)
                                    {
                                        USBHS_EP0_Buf[0] = 0x01;
                                    }
                                    break;

                                case(DEF_UEP3 | DEF_UEP_OUT):
                                    if(((USBHSD->UEP3_RX_CTRL) & USBHS_UEP_R_RES_MASK) == USBHS_UEP_R_RES_STALL)
                                    {
                                        USBHS_EP0_Buf[0] = 0x01;
                                    }
                                    break;

                                case(DEF_UEP4 | DEF_UEP_IN):
                                    if(((USBHSD->UEP4_TX_CTRL) & USBHS_UEP_T_RES_MASK) == USBHS_UEP_T_RES_STALL)
                                    {
                                        USBHS_EP0_Buf[0] = 0x01;
                                    }
                                    break;

                                case(DEF_UEP5 | DEF_UEP_OUT):
                                    if(((USBHSD->UEP5_RX_CTRL) & USBHS_UEP_R_RES_MASK) == USBHS_UEP_R_RES_STALL)
                                    {
                                        USBHS_EP0_Buf[0] = 0x01;
                                    }
                                    break;

                                case(DEF_UEP6 | DEF_UEP_IN):
                                    if(((USBHSD->UEP6_TX_CTRL) & USBHS_UEP_T_RES_MASK) == USBHS_UEP_T_RES_STALL)
                                    {
                                        USBHS_EP0_Buf[0] = 0x01;
                                    }
                                    break;

                                default:
                                    errflag = 0xFF;
                                    break;
                                }
                            }
                            else if((USBHS_SetupReqType & USB_REQ_RECIP_MASK) == USB_REQ_RECIP_DEVICE)
                            {
                                if(USBHS_DevSleepStatus & 0x01)
                                {
                                    USBHS_EP0_Buf[0] = 0x02;
                                }
                            }

                            if(USBHS_SetupReqLen > 2)
                            {
                                USBHS_SetupReqLen = 2;
                            }
                            break;

                        default:
                            errflag = 0xFF;
                            break;
                        }
                    }

